tap "caskformula/caskformula"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "shivammathur/php"
tap "wpscanteam/tap"
tap "yt-dlp/taps"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# OpenType text shaping engine
brew "harfbuzz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Package for scientific computing with Python
brew "numpy"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Matrix
brew "cmatrix"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fulltext search engine and column store
brew "groonga"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Statically typed programming language for the JVM
brew "kotlin"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Drop-in replacement for MySQL
brew "mariadb"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Platform built on V8 to build network applications
brew "node@16"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Web server scanner
brew "nikto"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# General-purpose scripting language
brew "php"
# Object-relational database system
brew "postgresql@13"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust", link: false
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Version control system designed to be a better CVS
brew "subversion"
# Process Control System
brew "supervisor"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Graphical network analyzer and capture tool
brew "wireshark"
# Access X11 clipboards from the command-line
brew "xclip"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp", link: false
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# General-purpose scripting language
brew "shivammathur/php/php@8.0"
# Black box WordPress vulnerability scanner
brew "wpscanteam/tap/wpscan"
# GPU-accelerated terminal emulator
cask "alacritty"
# Tools for building Android applications
cask "android-studio"
# Allows connection to a computer remotely
cask "anydesk"
# Web security testing toolkit
cask "burp-suite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Utilities designed to make common development tasks easier
cask "devtoys"
cask "font-fantasque-sans-mono"
# Open source code editor written in Rust
cask "lapce"
# File system integration
cask "macfuse"
# Web browser
cask "microsoft-edge"
# Explore and manipulate your MongoDB data
cask "mongodb-compass"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Tool to increase download speed
cask "xdm"
# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
